/* Буряківський Сергій, ТЕФ, варіант № 2.
Лабораторна робота № 5.1. Послідовна перевірка умов */

#include <stdio.h> 
#include <math.h>

int main(){
	float x, // значення аргумента
	y,       // значення функції
	a,b;     // параметри функції
	int ind; // індикатор друку значення функції
	/* Виведення вигляду функції на екран */
	printf("       ┌sqrt ( 5x^2 - a ),  x < 3\n");
	printf("f(x) = |bx + 8           ,  x = 3\n");
	printf("       └cos(x)           ,  3 < x < 11\n\n");
	// Введення вхідних даних
	printf("Введіть значення a ");
	scanf("%f", &a);
	printf("Введіть значення b ");
	scanf("%f", &b);
	printf("Введіть значення x ");
	scanf("%f", &x);
	printf("\n\n");
	/* Обчислення значення функції */
	ind = 0;
	/* Перший проміжок. Особливостей нема */
	if ( x>=0 && x<9 ){ 
		y = cos(x);
		ind = 1;
	}
	/* Другий проміжок. Особливостей нема */
	if ( x==9 ){ 
		y = 3*exp(a*x) + 1;
		ind = 1;
	}
	/* Третій проміжок. ОДЗ не порушено */
	if ( x>9 && x<11 && b*x-1>0 ){ 
		y = log(b*x-1);
		ind = 1; 
	}
	/* Третій проміжок. ОДЗ порушено */
	if ( x>9 && x<11 && b*x-1<=0 ) printf("Порушено ОДЗ\n");
	/* Значення х задано поза проміжком */
	if ( x<0 || x>=11) printf("Функція не визначена\n");
	/* Друк результату обчислення */
	if (ind) printf("f(%4.2f) = %6.3f", x, y);
	printf("\n\n");
	return 0;
}