/* Буряківський Сергій Віталійович, Варіант № 2.
Лабораторна робота № 6. Проектування алгоритмів і програм циклічної
структури (цикли з параметром, передумовою і післяумовою) */

#include <stdio.h>
#include <math.h>
#include <string.h>

int main() {
	double x1,x2,h,                     // границі проміжка і крок
			   a,b,                     // параметри a і b і змінна х
			 an, s,                     // степінь числа, сума
				 y;                     // обчислене значення функції
	double eps = 1e-10;                 // точність обчислень
	int 	   ind,                     // чи правильно задано вхідні дані
				 i,                     // номер обчисленого значення
				 n, 	                // лічильник циклу при обчисленні суми
				 k; 	                // кількість пар колонок
	char r1[20]="-------------------",  // риска 17
		 r2[20]="|   x   |   f(x)   ",  // заголовки колонок 19
		 r3[20]="|       |          ";  // порожні клітинки 19
	printf("Табулювання функції:\n");
	printf("\tf(x)=sqrt(3x+a)/sin(2x-b)*S+6e^(-|x|)\n");
	/* Задання ширини таблиці */
	ind = 1;
	do { 
		printf("Вкажіть кількість колонок таблиці (від 1 до 4): ");
		scanf("%d", &k);
		while (getchar() != '\n'); // очистка буфера
		if (k>=1 && k<=4) ind=0;
		else printf("***Неправильна кількість колонок\n");
	} while (ind);
	/* Введення вхідних даних */
	do { 
		printf("Вкажіть \n");
		printf("\t\tпроміжок x1 і х2: ");
		scanf("%lf %lf", &x1, &x2);
		printf("\t\tкрок h: ");
		scanf("%lf", &h);
		while (getchar() != '\n'); // очистка буфера
		if ( x1 < x2 && h <= x2-x1 && h>0) ind=1;
		else if (x1 > x2) printf("***Помилка: x1 >= x2\n");
		if (h > x2-x1 || h <= 0) printf("***Помилка: h > x2-x1 або h <= 0\n");
	} while (!ind);
	printf("\t\tзначення параметрів a i b: ");
	scanf("%lf%lf",&a,&b);
	while (getchar() != '\n'); // очистка буфера
	/* Заголовок таблиці */
	for (i = 0; i<k; i++) printf("%s", r1);
	printf("-\n");
	for (i = 0; i<k; i++) printf("%s", r2);
	printf("|\n");
	for (i = 0; i<k; i++) printf("%s", r1);
	printf("-\n");
	/* Проведення обчислень і заповнення таблиці */
	i = 1;
	while (x1 < x2 + eps) {
		printf("|%6.2f",x1);
		if (x1 <= eps || fabs(x1-a) < eps || fabs(x1-b)<1 ) printf(" | не визн  ");
		else {
			s = 0;
			an = 1;
			for (n=1; n <= 4; n++){
				an *= 5;
				s += (an+x1) / (n + 3.);
			}
			y = (log(x1) - 2)*s / (x1-a) + sqrt(log(fabs(x1-b)));
			if (fabs(y)>9999.99) printf(" |   переп  ");
			else printf(" | %8.2f ",y);
		}
		i++;
		x1 += h;
		if (i>k) {
			printf("|\n");
			i=1;
		}
	}
	/* Заповнення порожніми клітинками */
	for (i; i<=k; i++) printf("%s", r3);
	printf("|\n");
	/* Закриття таблиці */
	for (i=0; i<k; i++) printf("%s", r1);
	printf("-\n");
	return 0;
}