/*Буряківський Сергій Віталійович , група ТІ-01, варіант №2
*Лабараторна робота №4, програмування найпростіших обчислювальних
алгоритмів лінійної структури*/

#include <stdio.h> //підключення стандартної бібліотеки вводу/виводу
#include <math.h>  //підключає бібліотеку math.h для виконання математичних операцій


int main(){
	// Деклараційна частина
	float         a, x,   // Вхідні дані
	        f1, f2, f3,   // Результати обчислень
			         t;   // Додаткова змінна для переприсвоєння значень
	const int num1 = 1;   // Константа для числа 1
	const int num2 = 2;   // Константа для числа 2
	const int num4 = 4;   // Константа для числа 4
	// Частина виводу зазначених функцій
	printf("\nf1 = sqrt((x+2) / (2-ax)) + 4|log2(x) - 1|\n");
	printf("f2 = x(5x/4 + 3/10) - 2e^(3tgx+5)\n");
	printf("f3 = (2/5) * x^2,6\n");
	// Зчитування аргументів
	printf("Введіть значення a: ");
	scanf("%f", &a);
	printf("Введіть значення x: ");
	scanf("%f", &x);
	// Обчислення значень для заданих аргментів за допомогою окремих функцій
	f1 = sqrt((x+num2) / (num2-a*x)) + num4*fabs(log(x)/log(2) - num1);
	f2 = x*(1.25*x + 0.3) - 2*exp(3*tan(x) + 5);
	f3 = (double)num2/5 * pow(x, 2.6);
	// Вивід результату
	printf("   f1 = %.3f\n   f2 = %.3f\n   f3 = %.3f\n", f1, f2, f3);
	// Переприсвоєння значень
	t = f1;
	f1 = f2;
	f2 = f3;
	f3 = t;
	printf("Міняємо значення місцями:\n   f1 = %.3f\n   f2 = %.3f\n   f3 = %.3f\n", f1, f2, f3);
	return 0;
}